In [2]:
import pandas as pd

mydataset={
    "Tid":[1,2,3,4,5,6,7,8,9,10],
    "marital status": ["yes","no","no","yes","no","no","yes","no","no","no"],
    "Taxable Income":[125000,100000,70000,120000,95000,60000,220000,85000,75000,90000],
    "cheat":["no","no","no","no","yes","no","no","yes","no","yes"]
}

myvar=pd.DataFrame(mydataset)
print(myvar)

   Tid marital status  Taxable Income cheat
0    1            yes          125000    no
1    2             no          100000    no
2    3             no           70000    no
3    4            yes          120000    no
4    5             no           95000   yes
5    6             no           60000    no
6    7            yes          220000    no
7    8             no           85000   yes
8    9             no           75000    no
9   10             no           90000   yes

In [11]:
print(myvar.loc[[0,4,7]])

   Tid marital status  Taxable Income cheat
0    1            yes          125000    no
4    5             no           95000   yes
7    8             no           85000   yes

In [12]:
print(myvar.iloc[3:8])

   Tid marital status  Taxable Income cheat
3    4            yes          120000    no
4    5             no           95000   yes
5    6             no           60000    no
6    7            yes          220000    no
7    8             no           85000   yes

In [13]:
print(myvar.iloc[4:9 ,2:5])

   Taxable Income cheat
4           95000   yes
5           60000    no
6          220000    no
7           85000   yes
8           75000    no

In [14]:
print(myvar.iloc[:,1:3])

  marital status  Taxable Income
0            yes          125000
1             no          100000
2             no           70000
3            yes          120000
4             no           95000
5             no           60000
6            yes          220000
7             no           85000
8             no           75000
9             no           90000

In [2]:
import pandas as pd;
df=pd.read_csv('Iris.csv')

df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [3]:
df=df.drop(index=3)
df=df.drop(columns=df.columns[2])
print(df)

      Id  SepalLengthCm  PetalLengthCm  PetalWidthCm         Species
0      1            5.1            1.4           0.2     Iris-setosa
1      2            4.9            1.4           0.2     Iris-setosa
2      3            4.7            1.3           0.2     Iris-setosa
4      5            5.0            1.4           0.2     Iris-setosa
5      6            5.4            1.7           0.4     Iris-setosa
..   ...            ...            ...           ...             ...
145  146            6.7            5.2           2.3  Iris-virginica
146  147            6.3            5.0           1.9  Iris-virginica
147  148            6.5            5.2           2.0  Iris-virginica
148  149            6.2            5.4           2.3  Iris-virginica
149  150            5.9            5.1           1.8  Iris-virginica

[149 rows x 5 columns]

In [37]:
de=pd.DataFrame([{"empid":101,"name":"Alice","department":"HR","Age":29,"Salary":50000,"years_of_experience":4,"joining_date":"2020-03-15","gender":"female","bonus":5000,"rating":4.5},
                   {"empid":102,"name":"Bob","department":"IT","Age":34,"Salary":70000,"years_of_experience":8,"joining_date":"2017-07-19","gender":"male","bonus":7000,"rating":4.0},
                   {"empid":103,"name":"Charlie","department":"IT","Age":41,"Salary":65000,"years_of_experience":10,"joining_date":"2013-06-01","gender":"male","bonus":6000,"rating":3.8},
                   {"empid":104,"name":"Diana","department":"Marketing","Age":28,"Salary":55000,"years_of_experience":3,"joining_date":"2022-02-10","gender":"female","bonus":4500,"rating":4.7},
                   {"empid":105,"name":"Edward","department":"Sales","Age":38,"Salary":60000,"years_of_experience":12,"joining_date":"2010-11-25","gender":"male","bonus":5000,"rating":3.5}])

In [17]:
print(de)

   empid     name department Age  Salary  years_of_experience joining_date  \
0    101    Alice         HR  29   50000                    4   2020-03-15
1    102      Bob         IT  34   70000                    8   2017-07-19
2    103  Charlie         IT  41   65000                   10   2013-06-01
3    104    Diana  Marketing  28   55000                    3   2022-02-10
4    105   Edward      Sales  38   60000                   12   2010-11-25

   gender bonus rating
0  female  5000    4.5
1    male  7000    4.0
2    male  6000    3.8
3  female  4500    4.7
4    male  5000    3.5

In [19]:
print(de.shape)

(5, 10)

In [38]:
print(de.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   empid                5 non-null      int64
 1   name                 5 non-null      object
 2   department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   years_of_experience  5 non-null      int64
 6   joining_date         5 non-null      object
 7   gender               5 non-null      object
 8   bonus                5 non-null      int64
 9   rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

In [39]:
print(de.describe())

            empid        Age       Salary  years_of_experience   bonus  \
count    5.000000   5.000000      5.00000             5.000000     5.0
mean   103.000000  34.000000  60000.00000             7.400000  5500.0
std      1.581139   5.612486   7905.69415             3.847077  1000.0
min    101.000000  28.000000  50000.00000             3.000000  4500.0
25%    102.000000  29.000000  55000.00000             4.000000  5000.0
50%    103.000000  34.000000  60000.00000             8.000000  5000.0
75%    104.000000  38.000000  65000.00000            10.000000  6000.0
max    105.000000  41.000000  70000.00000            12.000000  7000.0

         rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

In [23]:
print(de.head())

   empid     name department Age  Salary  years_of_experience joining_date  \
0    101    Alice         HR  29   50000                    4   2020-03-15
1    102      Bob         IT  34   70000                    8   2017-07-19
2    103  Charlie         IT  41   65000                   10   2013-06-01
3    104    Diana  Marketing  28   55000                    3   2022-02-10
4    105   Edward      Sales  38   60000                   12   2010-11-25

   gender bonus rating
0  female  5000    4.5
1    male  7000    4.0
2    male  6000    3.8
3  female  4500    4.7
4    male  5000    3.5

In [24]:
print(de.tail(3))

   empid     name department Age  Salary  years_of_experience joining_date  \
2    103  Charlie         IT  41   65000                   10   2013-06-01
3    104    Diana  Marketing  28   55000                    3   2022-02-10
4    105   Edward      Sales  38   60000                   12   2010-11-25

   gender bonus rating
2    male  6000    3.8
3  female  4500    4.7
4    male  5000    3.5

In [26]:
avgsal=de['Salary'].mean()
print(f"the avg salary is {avgsal}")

the avg salary is 60000.0

In [40]:
totalsum=de['bonus'].sum()
print(totalsum)

27500

In [41]:
youngest=de['Age'].min()
print(f"youngest employee is {youngest}")

youngest employee is 28

In [42]:
highest_rating=de['rating'].max()
print(f"highest rating is {highest_rating}")

highest rating is 4.7

In [43]:
sort_dataframe=de.sort_values(by='Salary',ascending=False)
print(sort_dataframe)

   empid     name department  Age  Salary  years_of_experience joining_date  \
1    102      Bob         IT   34   70000                    8   2017-07-19
2    103  Charlie         IT   41   65000                   10   2013-06-01
4    105   Edward      Sales   38   60000                   12   2010-11-25
3    104    Diana  Marketing   28   55000                    3   2022-02-10
0    101    Alice         HR   29   50000                    4   2020-03-15

   gender  bonus  rating
1    male   7000     4.0
2    male   6000     3.8
4    male   5000     3.5
3  female   4500     4.7
0  female   5000     4.5

In [50]:
def performance(rating):
    if rating>=4.5:
        print("excellent")
    elif 4.0<=rating<=4.5:
        print("good")
    else:
        print("average")
de['performance']=de['rating'].apply(performance)

excellent
good
average
excellent
average

In [51]:
missingvalues=de.isnull()
print(missingvalues)

   empid   name  department    Age  Salary  years_of_experience  joining_date  \
0  False  False       False  False   False                False         False
1  False  False       False  False   False                False         False
2  False  False       False  False   False                False         False
3  False  False       False  False   False                False         False
4  False  False       False  False   False                False         False

   gender  bonus  rating  performance_ranting  performance
0   False  False   False                 True         True
1   False  False   False                 True         True
2   False  False   False                 True         True
3   False  False   False                 True         True
4   False  False   False                 True         True

In [52]:
de=de.rename(columns={'empid':'ID'})
print(de)

    ID     name department  Age  Salary  years_of_experience joining_date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2022-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   gender  bonus  rating performance_ranting performance
0  female   5000     4.5                None        None
1    male   7000     4.0                None        None
2    male   6000     3.8                None        None
3  female   4500     4.7                None        None
4    male   5000     3.5                None        None

In [ ]:

filtered= de[(de["years_of_experience"] > 5) & (de["department"]=="IT")]
print(filtered)

    ID     name department  Age  Salary  years_of_experience joining_date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  gender  bonus  rating performance_ranting performance     Tax
1   male   7000     4.0                None        None  7000.0
2   male   6000     3.8                None        None  6500.0

In [54]:
de['Tax']=de['Salary']*0.10
print(de)

    ID     name department  Age  Salary  years_of_experience joining_date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2022-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   gender  bonus  rating performance_ranting performance     Tax
0  female   5000     4.5                None        None  5000.0
1    male   7000     4.0                None        None  7000.0
2    male   6000     3.8                None        None  6500.0
3  female   4500     4.7                None        None  5500.0
4    male   5000     3.5                None        None  6000.0

In [56]:
de.to_csv("NewEmployees.csv", index=False)
print("Modified dataset saved to 'NewEmployees.csv'")

Modified dataset saved to 'NewEmployees.csv'